app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "purtovmv@mail.ru"], ["LIMIT", 1]]
---
  def create
    user = User.find_by email: params[:email]