app/controllers/stats_records_controller.rb

SELECT "stats_records".* FROM "stats_records"
---
  def index
    @stats_records = StatsRecord.all