app/controllers/valera_actions_controller.rb

  def show
    @valera_action = ValeraAction.find(params[:id])
---
SELECT "valera_actions".* FROM "valera_actions" WHERE "valera_actions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    if user_signed_in?
      @valera_action = ValeraAction.find(params[:id])
---
SELECT "valera_actions".* FROM "valera_actions" WHERE "valera_actions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    if user_signed_in?
      @valera_action = ValeraAction.find(params[:id])
---
SELECT "valera_actions".* FROM "valera_actions" WHERE "valera_actions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    if user_signed_in?
      @valera_action = ValeraAction.find(params[:id])
      @valera_action.destroy
---
SELECT "valera_actions".* FROM "valera_actions" WHERE "valera_actions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "valera_actions" WHERE "valera_actions"."id" = $1  [["id", 1]]

  def valera_action_save
    if @valera_action.save
---
INSERT INTO "valera_actions" ("name", "health", "alcohol", "happy", "tired", "money", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", "test"], ["health", 0], ["alcohol", 0], ["happy", 0], ["tired", 0], ["money", 0], ["created_at", "2022-01-19 17:02:57.646741"], ["updated_at", "2022-01-19 17:02:57.646741"]]